In [1]:
people={
    'first':['abdul','hafeez','salman'],
    'last':['wasay','rehman','samad'],
    'email':['wasay123@gmail.com','hafeez123@gmail.com','salman123@gmail.com']
}
import pandas as pd
df=pd.DataFrame(people)
df

    first    last                email
0   abdul   wasay   wasay123@gmail.com
1  hafeez  rehman  hafeez123@gmail.com
2  salman   samad  salman123@gmail.com

In [7]:
df.loc[0,'last']='javed'
df

    first    last                email
0   abdul   javed   wasay123@gmail.com
1  hafeez  rehman  hafeez123@gmail.com
2  salman   samad  salman123@gmail.com

In [11]:
df['full_name']=df['first']+" "+df['last']
df

    first    last                email      full_name
0   abdul   javed   wasay123@gmail.com    abdul javed
1  hafeez  rehman  hafeez123@gmail.com  hafeez rehman
2  salman   samad  salman123@gmail.com   salman samad

In [19]:
df.drop(columns=['first','last'])

                 email      full_name
0   wasay123@gmail.com    abdul javed
1  hafeez123@gmail.com  hafeez rehman
2  salman123@gmail.com   salman samad

In [23]:
df[['first','last']]=df['full_name'].str.split(' ',expand=True)
df

    first    last                email      full_name
0   abdul   javed   wasay123@gmail.com    abdul javed
1  hafeez  rehman  hafeez123@gmail.com  hafeez rehman
2  salman   samad  salman123@gmail.com   salman samad

In [74]:
filt=df['last']=='javed'
df.drop(index=df[filt].index)

    first    last                email      full_name
1  hafeez  rehman  hafeez123@gmail.com  hafeez rehman
2  salman   samad  salman123@gmail.com   salman samad

In [76]:
df

    first    last                email      full_name
0   abdul   javed   wasay123@gmail.com    abdul javed
1  hafeez  rehman  hafeez123@gmail.com  hafeez rehman
2  salman   samad  salman123@gmail.com   salman samad

In [80]:
df.sort_values(by='email')

    first    last                email      full_name
1  hafeez  rehman  hafeez123@gmail.com  hafeez rehman
2  salman   samad  salman123@gmail.com   salman samad
0   abdul   javed   wasay123@gmail.com    abdul javed

In [82]:
df.sort_values(by='email',ascending=False)

    first    last                email      full_name
0   abdul   javed   wasay123@gmail.com    abdul javed
2  salman   samad  salman123@gmail.com   salman samad
1  hafeez  rehman  hafeez123@gmail.com  hafeez rehman

In [98]:
df.sort_index()

    first    last                email      full_name
0   abdul   javed   wasay123@gmail.com    abdul javed
1  hafeez  rehman  hafeez123@gmail.com  hafeez rehman
2  salman   samad  salman123@gmail.com   salman samad

In [90]:
df.sort_values(by=['first','last'],ascending=[True,False])

    first    last                email      full_name
0   abdul   javed   wasay123@gmail.com    abdul javed
1  hafeez  rehman  hafeez123@gmail.com  hafeez rehman
2  salman   samad  salman123@gmail.com   salman samad